{***************************************}
{  Типы и константы ядра                }
{  Written by Kurnosov M.               }
{***************************************}

unit Types;

interface

  Const

    MAX_COUNT_ARGS    = 10; { макс. кол-во аргументов в проц - TProc }
  Type
    _PString = ^String;

    { ------------------------------------------------------------ }
    { Структура под Стек                                           }
    { ------------------------------------------------------------ }
    PStack = ^TStack;
    TStack = Record

      Name : String;

      selType : Byte; { Селектор типа :   }
                      { 1 - Строка        }
                      { 2 - Целое число   }
                      { 3 - Лог. велечина }

      Str  : String;
      Int  : Longint; {Integer;}
      Bool : Boolean;

    End; { TStack }

    { ------------------------------------------------------------ }
    { Структура под результат выражения. Базовые типы              }
    { ------------------------------------------------------------ }
    TResult = Record

      selType : Byte; { Селектор типа :   }
                      { 1 - Строка        }
                      { 2 - Целое число   }
                      { 3 - Лог. велечина }

      Str  : String;
      Int  : Longint; {Integer;}
      Bool : Boolean;
    End; { TResult }

    { ------------------------------------------------------------ }
    { структура под процедуры и функции                            }
    { ------------------------------------------------------------ }
    TFunction = Record

      Name       : String;   { имя процедуры или функции.    }
      Fun        : Boolean;  { True - фун. False - проц.     }

      { имена аргументов                                     }
      Args       : Array [1..MAX_COUNT_ARGS] of String;
      CountArgs  : Byte;  { кол-во аргументов.            }

      StartLine  : Word;     { Номер строки в SourceCode     }
                             { указывает на начало кода      }
                             { проц-ы.                       }

      Result     : TResult;  { Возращаемое значение функцией }
    End; { TFunction }

implementation

end.
